app/views/home/index.html.erb


          <%if !course.tasks.nil? && course.tasks.length > 0%>
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."course_id" = ? ORDER BY "tasks"."created_at" ASC LIMIT ?  [["course_id", 1], ["LIMIT", 1]]