app/controllers/home_controller.rb

SELECT "courses".* FROM "courses"
---
	def index
		@cheer = Cheer.new
		@courses = Course.all